InformationRegisters/ТекущаяРаботаПоЗаявкамКандидатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ТекущаяРаботаПоЗаявкамКандидатов</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаявокКандидатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаявкаКандидата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗаявкиКандидатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТекущаяРаботаПоЗаявкамКандидатов/Ext/RecordSetModule.bsl
Перем мНеИзменятьСостояниеВЗаявке Экспорт;

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если мНеИзменятьСостояниеВЗаявке = Неопределено Тогда
		мНеИзменятьСостояниеВЗаявке = Ложь;
	КонецЕсли;
	
	Если мНеИзменятьСостояниеВЗаявке Тогда
		Возврат;
	КонецЕсли;
	
	ЗаявкаКандидата = Отбор.ЗаявкаКандидата.Значение;
	Если Не ЗначениеЗаполнено(ЗаявкаКандидата) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаявкаКандидатаОбъект = ЗаявкаКандидата.ПолучитьОбъект();
	Если ЗаявкаКандидатаОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТекущаяРаботаПоЗаявкамКандидатов.Состояние
	|ИЗ
	|	РегистрСведений.ТекущаяРаботаПоЗаявкамКандидатов КАК ТекущаяРаботаПоЗаявкамКандидатов
	|ГДЕ
	|	ТекущаяРаботаПоЗаявкамКандидатов.Состояние <> ЗНАЧЕНИЕ(Справочник.СостоянияЗаявокКандидатов.ПустаяСсылка)
	|	И ТекущаяРаботаПоЗаявкамКандидатов.ЗаявкаКандидата = &ЗаявкаКандидата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТекущаяРаботаПоЗаявкамКандидатов.Период УБЫВ";
	Запрос.УстановитьПараметр("ЗаявкаКандидата",	ЗаявкаКандидата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаявкаКандидатаОбъект.Состояние = Выборка.Состояние;
	Иначе
		ЗаявкаКандидатаОбъект.Состояние = 0;
	КонецЕсли;
	
	ЗаявкаКандидатаОбъект.Записать();
	
КонецПроцедуры
